{
	"$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentParameters.json#",
	"contentVersion": "1.0.0.0",
	"parameters": {
		"subscriptionId": {
			"value": "<REPLACE>"
		},
		"functionName": {
			"value": "Remove-Unauthorized-Role-Assignment"
		},
		"actionGroup": {
			"value": {
				"actionGroupShortName": "monitor-role"
			}
		},
		"scheduledQueryRuleUnauthorizedRoleAssignments": {
			"value": {
				"autoMitigate": false,
				"checkWorkspaceAlertsStorageConfigured": false,
				"minFailingPeriodsToAlert": 1,
				"numberOfEvaluationPeriods": 1,
				"operator": "GreaterThan",
				"query": "AzureActivity\n| where CategoryValue =~ \"Administrative\" and OperationNameValue =~ \"Microsoft.Authorization/roleAssignments/write\"and ActivityStatusValue =~ \"Success\" // Only select the creation of Role Assignments that succeeded\n| where _ResourceId matches regex \"^\\\\/subscriptions\\\\/[a-f0-9]{8}(-[a-f0-9]{4}){3}-[a-f0-9]{12}\\\\/providers\\\\/microsoft\\\\.authorization\\\\/roleassignments\\\\/[a-f0-9]{8}(-[a-f0-9]{4}){3}-[a-f0-9]{12}$\" or _ResourceId matches regex \"^\\\\/subscriptions\\\\/[a-f0-9]{8}(-[a-f0-9]{4}){3}-[a-f0-9]{12}\\\\/resourcegroups\\\\/[a-zA-Z0-9._\\\\-()]+\\\\/providers\\\\/microsoft\\\\.authorization\\\\/roleassignments\\\\/[a-f0-9]{8}(-[a-f0-9]{4}){3}-[a-f0-9]{12}$\" // Only select the creation of Role Assignments on the Subscription or Resource Group scope\n| where Caller != \"87794bfc-4bf9-4695-b010-154387cedcc3\"// Only select the creation of Role Assignments not conducted Privileged Identity Management (87794bfc-4bf9-4695-b010-154387cedcc3)\n| project TimeGenerated, Caller, _SubscriptionId, _ResourceId // Only project information on when the Role Assignment is created, by whom, and on what Azure resource\n\n",
				"resourceIdColumn": "_ResourceId",
				"threshold": 0,
				"timeAggregation": "Count",
				"scheduledRuleQueryDescription": "This Scheduled Query Rule fires when an unauthorized Role Assignment has been created.",
				"evaluationFrequency": "PT5M",
				"logAnalyticsWorkspaceId": "<REPLACE>",
				"severity": 2,
				"windowSize": "PT5M"
			}
		}
	}
}